/*29.  (deque)В текстовому файлі знаходяться дані про витрати матеріалів бригад деякої будівельної фірми. Це номер бригади, дані про бригадира, список витрачених матеріалів з зазначенням дати, назви матеріалу, об’єму, вартості. Дані у файлі можуть повторюватися (для однієї бригади – декілька записів
----зчитати дані з файлу у контейнер і  відобразити їх на екрані (і записати у відповідні файли) у алфавітному порядку бригадирів. При цьому декілька даних про витрати для кожної бригади об’єднуються в одну
----За заданим числом – номером бригади, видрукувати по датах (відсортованих) витрати матеріалів і обчислити загальну суму витрат. відобразити це у файлі
*/

#include<iostream>
#include"Bud_firm.h"
#include<iostream>
#include<deque>
#include<string>
#include<fstream>
using namespace std;
#include<algorithm>
#include"Helperfunctions.h"




int main()
{
    deque<Brugada> arr = input_information("/Users/Andriana/Desktop/dz_programming/2 year/task1/task1/file.txt");
    
    task1(arr);
    
    task2(arr);
    
    system("pause");
}
