/*
 14. (стек) Назвемо (ієрархічним) “списком”  замкнену в круглі дужки  послідовність елементів, розділених комами; елементи  списку – це атоми або знову списки:
<список>::=()|(<елементи>)
<елементи>::=<елемент>|<елемент>,<елементи>
<елемент>::=<атом>|<список>
Під атомом слід розуміти послідовність, в яку входить від 1 до n букв і цифр , де n- заздалегідь відоме натуральне число. Приклад подібного списку:( AD75, (3,(),(7,H))).
Визначити клас для збарігання такого списку з наступним рекурсивними методами чи дружніми функціями:
а) метод member(A), який перевіряє ,чи входить атом  A  в список;
б) функцію equal(L1,L2), який перевіряє на рівність списки  L1 та L2;
в) метод  printat(), який друкує всі атоми, що входять в список;
г) метод  printlist(), який друкує список в тому вигляді,  в якому він визначений металінгвістичними формулами, вказаними вище;
д) метод readlist(), яка зчитує із вхідного файлу записаний без помилок список і будує  відповідне наведення цього списку.
*/


#include<iostream>
using namespace std;

int main()
{
    cout<<"HELLO ANDRII"<<endl;
}
